import pandas as pd

data = {
    'Набор А': [85, 90, 95, 100, 105],
    'Набор Б': [70, 80, 95, 110, 120],
}

#Создаём датафрейм
df = pd.DataFrame(data)

#стандартное отклонение в данных наборах .std()
stdA=df['Набор А'].std()
stdB=df['Набор Б'].std()
print(stdA, stdB)


data1 = {
    'Возраст': [23, 22, 21, 27, 23, 20, 29, 28, 22, 25],
    'Зарплата': [54000, 58000, 60000, 52000, 55000, 59000, 51000, 49000, 53000, 61000],
}

df1 = pd.DataFrame(data1)
print(df1.describe())
#всё в одном массиве текста. Выведем эти значения по отдельности.
print(f"Средний возраст - {df1['Возраст'].mean()}")
print(f"Медианный возраст - {df1['Возраст'].median()}")
print(f"Стандартное отклонение возраста - {df1['Возраст'].std()}")

print(f"Средняя зарплата - {df1['Зарплата'].mean()}")
print(f"Медианная зп - {df1['Зарплата'].median()}")
print(f"Стандартное отклонение зп - {df1['Зарплата'].std()}")